{
	"todo": "TRY THIS:  Click on Let's Go button then start clicking yellow dots in counterclockwise direction, accumulating phase over time.  You can skip dots and you only have to click at least 1 yellow dot that isn't at zero and you must finish by clicking on the 0 deg/360 deg point to stop the clock.  If you want to go really fast and get a high frequency, you can just start clicking dots, I will assume you wanted to start timer and do it for you.",
	"expln": "EXPLANATION: As you move counter-clockwise around the unit circle, you are adding phase until you make a complete circle and we calculate your average phase accumulation over time (also known as frequency).  The period of your sine wave is the time it took you to complete a full cycle of the sine wave (0 to 360 degrees).  The frequency (in Hz) is 1 divided by the period (in seconds).  I don't force you to hit every yellow dot, you can skip to get your frequency up.  I do force you to hit at least two samples per period, the last one being 360 degrees (for my convenience so I know when to stop the clock).  The oldest frequency you created is on top and newest on bottom and those colors match the waveforms off to the right.  The upper graph shows a full 20 sec and the lower one is a blowup of the first 2 sec. You can see high frequency sinusoids better on the lower graph and low frequency sinusoids better on the upper graph.  You can also see that the higher frequency waveforms have more squiggles than the lower frequency ones for the same time duration.  With a human clicking dots, its pretty hard to get much above 1 Hz.  In the next page, we'll go faster because humans won't be doing the sampling.  You can measure the period of each waveform and see that it matched the time it took you to create it.  What you are really doing is sampling a complex signal, one with a real and imaginary component.  Remember the Origin of Sine Cosine page where cosine was along x axis and sine was along y axis?  But don't worry too much about all that, thats a college concept."

}