{
	"TestNote": [
		{"instrument": "Synthesized", "musicalNote": "all", "title":"Synthesized Tone", "fundamentalHz": "", "filename": "", "tuneOffset": "0", "fundamentalPhase":"0",
		"todo": "TRY THIS:  Turn on your speaker.  Hit Start Tone and adjust Frequency and notice the pitch goes up and down.  Adjust Amplitude and notice only the volume changes.  Adjust Phase slowly and not there is no perceived change but if you change it quickly, you get a popping sound.  Tone phase only means something compared to a tone of a different phase.  When you change phase quickly, you hear phase 1 relative to phase 2, phase 3 etc.  It produces a discontinuity or a pop sound.",
		"expln": "EXPLANATION:  Synthesized Tone.  Sine and Cosine functions, when translated to voltage and sent to a speaker are just tones. Pure tones are of one frequency only. As the amplitude changes it gets louder/softer.  You can't hear slow phase changes. If you change phase very fast, it sounds like pops in the speaker.  As you change frequency, you can move from low bass up to the midrange of human hearing at 10,000 Hz.  Musical notes are made up of a fundamental frequency, which is one of the tones you create here plus some harmonics and overtones that give the instrument its richness.  You can use the synthesized tones produced here to tune an instrument to within 1 Hz using the trig formulas you are also studying"
	    },
		{"instrument": "Bflat trumpet", "musicalNote": "C5", "title":"Bflat Trumpet Plays C5 Tuning Note", "fundamentalHz": "466", "filename": "BDM_trumpet_468.MP3", "tuneOffset": "10000", "fundamentalPhase":"44",
		"todo": "TRY THIS:  Turn on your speaker.  Hit Start Tone and play the synthesized tone at 466 Hz (almost a C5, which is 466.15 Hz).  Hit Play Note and play the trumpet mp3 recording which is very close to 466 Hz (a tiny bit out of tune).  The synthesized tone is like a concert master with perfect pitch.  You can tune your instrument to eliminate the beat note.",
		"expln": "EXPLANATION:  Bflat trumpet playing C tuning note, which comes out as Bflat, ideally at 466.16 Hz.  The orange line is the waveform created by the trumpet.  You can see the trumpet waveform is periodic, like the sine wave, and at (approximately) the same fundamental frequency as the sine wave. If you have a musically trained ear, you may hear a beat note with the synthesized tone since this trumpet is 2 Hz out of tune.  The note played is the tuning note C played by all instruments in an orchestra before a concert.  Try loading up some other instrument waveforms!  All instruments will have this same fundamental frequency but the waveform will be shaped differently for each instrument.  One could synthesize this trumpet sound by using a tone at the fundamental frequency and adding in other tones at different frequencies/phases/amplitudes to give this unique waveform shape and sound."
		},
		{"instrument": "Clarinet", "musicalNote": "C5", "title":"Clarinet Plays C5 Tuning Note", "fundamentalHz": "466", "filename": "DG_clarinet467.MP3", "tuneOffset": "10000", "fundamentalPhase":"44",
		"todo": "TRY THIS:  Turn on your speaker.  Hit Start Tone and play the synthesized tone at 466 Hz (almost a C5, which is 466.15 Hz).  Hit Play Note and play the clarinet mp3 recording which is very close to 466 Hz (a tiny bit out of tune).  The synthesized tone is like a concert master with perfect pitch.  You can tune your instrument to eliminate the beat note.",
		"expln": "EXPLANATION:  Clarinet playing C tuning note, which is ideally at 466.16 Hz.  The purple line is the waveform created by the clarinet.  You can see the clarinet waveform is periodic, like the sine wave, and at (approximately) the same fundamental frequency as the sine wave. This is the tuning note C played by all instruments in an orchestra before a concert.  Try loading up some other instrument waveforms!  All instruments will have this same fundamental frequency but the waveform will be shaped differently for each instrument.  One could synthesize this clarinet sound by using a tone at the fundamental frequency and adding in other tones at different frequencies/phases/amplitudes to give this unique waveform shape and sound."
		}
	]
}