{
	"TestNote": [
		{"instrument": "Trumpet", "musicalNote": "C5", "title":"Sine Wave and Trumpet Play C5 note", "fundamentalHz": "466", "tuneOffset": "10000", 
		"todo": "TRY THIS:  Turn on your speaker.  Hit Start Tone and play the synthesized tone at 466 Hz (almost a C5, which is 466.15 Hz).  Hit Play Note and play the trumpet mp3 recording which is very close to 466 Hz (a tiny bit out of tune).",
		"expln": "EXPLANATION:  Bflat trumpet playing C5 note, which comes out as Bflat, ideally at 466.16 Hz.  The orange line is the waveform created by the trumpet.  You can see the trumpet waveform is periodic, like the sine wave, and at (approximately) the same fundamental frequency as the sine wave. If you have a musically trained ear, you may hear a beat note with the synthesized tone since this trumpet is 2 Hz out of tune.  An instrument plays a note but the sound/pitch depend on what group the instrument belongs to.  The trumpet, clarinet, soprano sax are all Bflat instruments.  So C5 has the same pitch frequency as the sine wave tone.  Try loading up some other instrument waveforms!  All waveforms will have the same fundamental pitch frequency but the waveforms will be shaped differently for each instrument, giving each instrument it's own sound.  One could synthesize this trumpet sound by using a tone at the fundamental frequency and adding in other tones at different frequencies/phases/amplitudes to give this unique waveform shape and sound."
		},
		{"instrument": "Clarinet", "musicalNote": "C5", "title":"Sine Wave and Clarinet Plays C5 Note", "fundamentalHz": "466", "tuneOffset": "20000",
		"todo": "TRY THIS:  Turn on your speaker.  Hit Start Tone and play the synthesized tone at 466 Hz (almost a C5, which is 466.15 Hz).  Hit Play Note and play the clarinet mp3 recording which is close to 466 Hz.",
		"expln": "EXPLANATION:  Clarinet playing C5 note, which is ideally at 466.16 Hz.  The orange line is the waveform created by the clarinet.  You can see the waveform is periodic, like the sine wave, and at (approximately) the same fundamental frequency as the sine wave.  The harmonics and overtones give the clarinet its unique sound over the sine wave pitch frequency.  Try loading up some other instrument waveforms! One could synthesize this clarinet sound by using a tone at the fundamental frequency and adding in other tones at different frequencies/phases/amplitudes to give this unique waveform shape and sound."
		},
		{"instrument": "Soprano Sax", "musicalNote": "C5", "title":"Sine Wave and Soprano Sax Plays C5 Note", "fundamentalHz": "466", "tuneOffset": "10000",
		"todo": "TRY THIS:  Turn on your speaker.  Hit Start Tone and play the synthesized tone at 466 Hz (almost a C5, which is 466.15 Hz).  Hit Play Note and play the soprano sax mp3 recording which is 466.16Hz. ",
		"expln": "EXPLANATION:  Soprano Sax  playing C5, which is ideally at 466.16 Hz.  The orange line is the waveform created by the soprano sax.  You can see the waveform is periodic, like the sine wave, and at (approximately) the same fundamental frequency as the sine wave. Try loading up some other instrument waveforms!  Notice how the shape of each instruments waveform has the same fundamental pitch but different overtones/harmonics to give each instrument its unique sound.  One could synthesize this soprano sax sound by using a tone at the fundamental frequency and adding in other tones at different frequencies/phases/amplitudes to give this unique waveform shape and sound."
		},
		{"instrument": "Tenor Sax", "musicalNote": "C4", "title":"Sine Wave and Tenor Sax Plays C4 Note", "fundamentalHz": "233", "tuneOffset": "10000", 
		"todo": "TRY THIS:  Turn on your speaker.  Hit Start Tone and play the synthesized tone at 233 Hz, an octave lower than the soprano sax.  Hit Play Note and play the tenor sax mp3 recording which is close to 233 Hz.  Later check out the section on trig identities to see why we can tune an instrument an octave lower with the other higher pitch instruments",
		"expln": "EXPLANATION:  Tenor sax playing C5 note, which is ideally at 233.08 Hz.  Like the trumpet, clarinet and soprano sax, the C5 note produces the same pitch frequency but the tenor sax is designed more for the lower octaves.  The C4 is exactly 1/2 the frequency of the C5 note.  The orange line is the waveform created by the tenor sax.  You can see the waveform is periodic, like the sine wave, and at (approximately) the same fundamental frequency as the sine wave pitch frequency"
		},
		{"instrument": "Flute", "musicalNote": "B4flat", "title":"Sine Wave and Flute Play B4&#9837 note", "fundamentalHz": "466", "tuneOffset": "10000",
		"todo": "TRY THIS:  Turn on your speaker.  Hit Start Tone and play the synthesized tone at 466 Hz.  Hit Play Note and play the flute mp3 recording which is very close to 466 Hz.  The flute is a C instrument and so it plays a slightly different note to match the other Bflat instruments.  ",
		"expln": "EXPLANATION:  We are forcing a flute to match other Bflat instruments in pitch frequency of 466.16 Hz.  The orange line is the waveform created by the flute.  You can see the flute waveform is periodic, like the sine wave, and at (approximately) the same fundamental frequency as the sine wave."
		}
	]
}